Repository: kenichisutan/canadian-budget-en-fr-sentiment-analysis
Catalog: data/corpora/federal-budget/budget-2025-en-budget-2025-fr.tmx
Source language: en_en
Languages: fr_fr

source: Marginal note: Expenditure limit — ECPC (10.6) For the purpose of subsection (10.1), a particular eligible Canadian public corporation's expenditure limit for a particular taxation year is the amount determined by the formula $6 million × ($60 million – A)/$60 million where A is (a) nil, if the following amount is less than or equal to $15 million: (i) if the particular corporation is not a member of a consolidated group in the particular taxation year, the amount that is the average, over the period of three fiscal years immediately preceding and ending before the particular taxation year, of its annual revenue based on the amounts reflected in the financial statements of the corporation, and (ii) if the particular corporation is a member of a consolidated group in the particular taxation year, the amount that is the average, over the period of three fiscal years immediately preceding and ending before the particular taxation year, of the annual revenue reflected in the consolidated financial statements of the group, and (b) in any other case, the lesser of $60 million and the amount by which the amount determined under subparagraph (a)(i) or (ii), as the case may be, exceeds $15 million.
fr_fr: Note marginale : Limite de dépenses — SPCA (10.6) Pour l'application du paragraphe (10.1), la limite de dépenses d'une société publique canadienne admissible donnée pour une année d'imposition donnée correspond à la somme obtenue par la formule suivante : 6 000 000 $ × (60 000 000 $ – A)/60 000 000 $ où : A représente : a) zéro, si la somme applicable ci-après est égale ou inférieure à 15 000 000 $ : (i) si la société donnée n'est pas membre d'un groupe consolidé au cours de l'année donnée, le montant qui représente la moyenne, sur la période de trois exercices précédant immédiatement et se terminant immédiatement avant l'année d'imposition donnée, de son revenu annuel selon les montants indiqués dans ses états financiers, (ii) si la société donnée est membre d'un groupe consolidé au cours de l'année donnée, le montant qui représente la moyenne, sur la période de trois exercices précédant immédiatement et se terminant immédiatement avant l'année d'imposition donnée, du revenu annuel indiqué dans les états financiers consolidés du groupe, b) dans les autres cas, 60 000 000 $ ou, s'il est moins élevé, l'excédent, sur 15 000 000 $, de la somme déterminée selon les sous-alinéas a)(i) ou (ii), selon le cas.

source: Marginal note: Expenditure limits — consolidated ECPCs (10.61) Notwithstanding subsection (10.6), the expenditure limit for a taxation year of an eligible Canadian public corporation that is, at any time in the year, a member of a consolidated group is, except as otherwise provided in this section, nil.
fr_fr: Note marginale : Limites de dépenses — SPCA consolidées (10.61) Malgré le paragraphe (10.6), la limite de dépenses pour une année d'imposition d'une société publique canadienne admissible qui est, à un moment donné de l'année, membre d'un groupe consolidé est zéro, sauf indication contraire au présent article.

source: Marginal note: Consolidated ECPCs (10.62) If all of the eligible Canadian public corporations that are members of a consolidated group file with the Minister in prescribed form an agreement under which, for the purpose of subsection (10.1), they allocate an amount to one or more of them for the year and the amount so allocated or the total of the amounts so allocated, as the case may be, does not exceed the amount determined for the year by the formula in subsection (10.6), the expenditure limit for the year of each of the corporations is the amount so allocated to it.
fr_fr: Note marginale : SPCA consolidées (10.62) Si toutes les sociétés publiques canadiennes admissibles qui sont membres d'un groupe consolidé présentent au ministre, selon le formulaire prescrit, une convention selon laquelle, pour l'application du paragraphe (10.1), elles attribuent un montant à une ou plusieurs d'entre elles pour l'année, et le montant ainsi attribué ou le total des montants ainsi attribués, selon le cas, ne dépasse pas la somme déterminée pour l'année par la formule figurant au paragraphe (10.6), la limite de dépenses pour l'année de chacune des sociétés correspond au montant qui lui est ainsi attribué.

source: Marginal note: Failure to file agreement (10.63) If any of the eligible Canadian public corporations that are members of a consolidated group fails to file with the Minister an agreement as contemplated by subsection (10.62) within 30 days after notice in writing by the Minister is forwarded to any of them that such an agreement is required for the purposes of this Part, the Minister shall, for the purpose of subsection (10.1), allocate an amount to one or more of them for the year, which amount or the total of which amounts, as the case may be, shall equal the amount determined for the year by the formula in subsection (10.6), and in any such case the expenditure limit for the year of each of the corporations is the amount so allocated to it.
fr_fr: Note marginale : Défaut de présenter une convention (10.63) Si l'une des sociétés publiques canadiennes admissibles qui sont membres d'un groupe consolidé fait défaut de présenter au ministre une convention prévue au paragraphe (10.62) dans les 30 jours après qu'une d'entre elles reçoit un avis écrit du ministre indiquant qu'une telle convention est requise pour l'application de la présente partie, le ministre attribuera, pour l'application du paragraphe (10.1), un montant à une ou plusieurs d'entre elles pour l'année, dont le montant ou le total des montants, selon le cas, sera égal au montant obtenu pour l'année par la formule figurant au paragraphe (10.6), et en un tel cas, la limite de dépenses pour l'année de chaque société correspond au montant qui lui est ainsi attribué.

source: Marginal note: Determinations in certain cases (10.64) Notwithstanding any other provision of this section, (a) where an eligible Canadian public corporation (in this paragraph referred to as the "first corporation") has more than one taxation year ending in the same calendar year and in two or more of those taxation years it is a member of a consolidated group in which another eligible Canadian public corporation has a taxation year ending in that calendar year, the expenditure limit of the first corporation for each taxation year in which it is in the same group as the other corporation ending in that calendar year is, subject to the application of paragraph (b), an amount equal to its expenditure limit for the first such taxation year determined without reference to paragraph (b); (b) where an eligible Canadian public corporation has a taxation year that is less than 51 weeks, its expenditure limit for the year is that proportion of its expenditure limit for the year determined without reference to this paragraph that the number of days in the year is of 365; (c) for the purpose of subparagraph (a)(i) of the description of A in subsection (10.6), where one or more of the fiscal years of an eligible Canadian public corporation is less than 51 weeks, the revenue reflected in the financial statements for each of those fiscal years shall be determined by multiplying that amount by the ratio that 365 is of the number of days in that year; (d) for the purpose of subparagraph (a)(ii) of the description of A in subsection (10.6), where one or more of the fiscal years of the ultimate parent entity of a consolidated group is less than 51 weeks, the revenue reflected in the consolidated financial statements of the entity for each of those fiscal years shall be determined by multiplying that amount by the ratio that 365 is of the number of days in that year; and (e) for the purpose of subparagraphs (a)(i) and (ii) of the description of A in the formula in subsection (10.6), (i) the average annual revenue referred to in each subparagraph is to be calculated over the actual number of fiscal years if there are less than three fiscal periods immediately preceding and ending before the particular taxation year, and (ii) if paragraph (10.32)(c) applies, the average annual revenue referred to in that paragraph is to be calculated over the actual number of fiscal years if there are less than three fiscal years immediately preceding and ending in the calendar year referred to in that paragraph.
fr_fr: Note marginale : Déterminations dans certains cas (10.64) Malgré les autres dispositions du présent article, a) sous réserve de l'alinéa b), lorsqu'une société publique canadienne admissible (la « première société » au présent alinéa) a plus d'une année d'imposition au cours de la même année civile et qu'elle est membre, au cours d'au moins deux de ces années, d'un groupe consolidé dans lequel une autre société publique canadienne admissible a une année d'imposition au cours de cette année civile, la limite de dépenses de la première société pour chaque année d'imposition qui se termine au cours de la même année civile et où elle se trouve dans le même groupe que l'autre société est égale à sa limite de dépenses pour la première de ces années d'imposition — déterminée compte non tenu de l'alinéa b); b) lorsqu'une société publique canadienne admissible a une année d'imposition de moins de 51 semaines, sa limite de dépenses pour l'année est la fraction de sa limite de dépenses pour l'année déterminée compte non tenu du présent alinéa que représente le nombre de jours de son année d'imposition par rapport à 365; c) pour l'application du sous-alinéa a)(i) de l'élément A de la formule figurant au paragraphe (10.6), lorsqu'un ou plusieurs exercices d'une société publique canadienne admissible compte moins de 51 semaines, le revenu indiqué dans les états financiers pour chacun de ces exercices correspond au produit de la multiplication de cette somme par le rapport entre 365 et le nombre de jours de cet exercice; d) pour l'application du sous-alinéa a)(ii) de l'élément A de la formule figurant au paragraphe (10.6), lorsqu'un ou plusieurs exercices de l'entité mère ultime d'un groupe consolidé compte moins de 51 semaines, le revenu indiqué dans les états financiers consolidés de l'entité pour chacun de ces exercices correspond au produit de la multiplication de cette somme par le rapport entre 365 et le nombre de jours dans cet exercice. e) pour l'application des sous-alinéas a)(i) et (ii) de l'élément A de la formule figurant au paragraphe (10.6) : (i) le revenu annuel moyen visé à chacun des sous-alinéas doit être calculé sur le nombre réel d'exercices si moins de trois exercices précédent immédiatement et se terminent immédiatement avant l'année d'imposition donnée; (ii) si l'alinéa (10.32)c) s'applique, le revenu annuel moyen visé à cet alinéa sera calculé sur le nombre réel d'exercices si moins de trois exercices précèdent immédiatement et se terminent immédiatement au cours de l'année civile visée à cet alinéa.

source: (3) Subsections (1) and (2) apply to taxation years that begin on or after December 16, 2024.
fr_fr: (3) Les paragraphes (1) et (2) s'appliquent aux années d'imposition commençant à compter du 16 décembre 2024.

source: 1 Paragraph (a) of the definition tax deferred cooperative share in subsection 135.1(1) of the Act is replaced by the following:
fr_fr: 1 L'alinéa a) de la définition de part à imposition différée , au paragraphe 135.1(1) de la même loi, est remplacé par ce qui suit :

source: (a) issued, after 2005 and before 2031, by an agricultural cooperative corporation to a person or partnership that is at the time the share is issued an eligible member of the agricultural cooperative corporation, pursuant to an allocation in proportion to patronage;
fr_fr: a) elle est émise après 2005 et avant 2031, conformément à une répartition proportionnelle à l'apport commercial, par une coopérative agricole à une personne ou une société de personnes qui est, au moment de son émission, un membre admissible de la coopérative;

source: 1 (1) The definition critical mineral in subsection 127(9) of the Act is replaced by the following: critical mineral critical mineral means bismuth, cesium, chromium, cobalt, copper, fluorspar, gallium, germanium, graphite, indium, lithium, magnesium, manganese, molybdenum, nickel, niobium, a platinum group metal, a rare earth element, scandium, tantalum, tellurium, tin, titanium, tungsten, uranium, vanadium or zinc; ( minéral critique )
fr_fr: 1 (1) La définition de minéral critique , au paragraphe 127(9) de la même loi, est remplacée par ce qui suit : minéral critique minéral critique S'entend du bismuth, du césium, du chrome, du cobalt, du cuivre, d'un élément des terres rares, de l'étain, de la fluorine, du gallium, du germanium, du graphite, de l'indium, du lithium, du magnésium, du manganèse, d'un métal du groupe du platine, du molybdène, du nickel, du niobium, du scandium, du tantale, du tellure, du titane, du tungstène, de l'uranium, du vanadium ou du zinc. ( critical mineral )

source: (2) Subsection (1) applies in respect of expenses renounced under a flow-through share agreement entered into after Budget Day.
fr_fr: (2) Le paragraphe (1) s'applique relativement aux dépenses auxquelles il est renoncé aux termes d'une convention d'émission d'actions accréditives conclue après le jour du budget.

source: 1 (1) The definition qualifying material in subsection 127.49(1) of the Act is amended by striking out "and" at the end of paragraph (e) and by adding the following after subparagraph (f): (g) antimony; (h) gallium; (i) germanium; (j) indium; and (k) scandium.
fr_fr: 1 (1) La définition de matériau admissible , au paragraphe 127.49(1) de la même loi, est modifié par adjonction, après l'alinéa (f), de ce qui suit : (g) l'antimoine; (h) le gallium; (i) le germanium; (j) l'indium; (k) le scandium.

source: (2) Subsection (1) applies in respect of property that is acquired and becomes available for use on or after Budget Day.
fr_fr: (2) Le paragraphe (1) s'applique aux biens acquis, et qui deviennent prêts à être mis en service, à compter du jour du budget.

source: 1 (1) Paragraphs (a) and (b) of the definition specified percentage in subsection 127.44(1) of the Act are replaced by the following: (a) qualified carbon capture expenditure if incurred in respect of carbon capture (i) directly from ambient air (A) after 2021 and before 2036, 60%, (B) after 2035 and before 2041, 30%, or (C) after 2040, 0%, or (ii) other than directly from ambient air (A) after 2021 and before 2036, 50%, (B) after 2035 and before 2041, 25%, or (C) after 2040, 0%; and (b) qualified carbon transportation expenditure, qualified carbon storage expenditure or qualified carbon use expenditure if incurred (i) after 2021 and before 2036, 37 1/2%, (ii) after 2035 and before 2041, 18 3/4%, or (iii) after 2040, 0%. ( pourcentage déterminé )
fr_fr: 1 (1) Les alinéas a) et b) de la définition de pourcentage déterminé , au paragraphe 127.44(1) de la même loi, sont remplacés par ce qui suit : a) une dépense admissible pour le captage du carbone si celle-ci est engagée relativement au captage du carbone selon l'une des méthodes suivantes : (i) directement de l'air ambiant : (A) après 2021 et avant 2036, 60 %, (B) après 2035 et avant 2041, 30 %, (C) après 2040, 0 %, (ii) autrement que directement de l'air ambiant : (A) après 2021 et avant 2036, 50 %, (B) après 2035 et avant 2041, 25 %, (C) après 2040, 0 %; b) une dépense admissible pour le transport du carbone, une dépense admissible pour le stockage du carbone ou une dépense admissible pour l'utilisation du carbone, si elle est engagée : (i) après 2021 et avant 2036, 37 1/2 %, (ii) après 2035 et avant 2041, 18 3/4 %, (iii) après 2040, 0 %. ( specified percentage )

source: (2) Subsection (1) is deemed to have come into force on Budget Day.
fr_fr: (2) Le paragraphe (1) est réputé être entré en vigueur le jour du budget.

source: 1 The Act is modified to give effect to the proposals relating to the Clean Electricity Investment Tax Credit and Canada Growth Fund as described in the budget documents tabled by the Minister of Finance in the House of Commons on Budget Day.
fr_fr: 1 La Loi est modifiée pour donner effet aux propositions relatives au Crédit d'impôt à l'investissement pour l'électricité propre et le Fonds de croissance du Canada énoncées dans les documents budgétaires déposés à la Chambre des communes par la ministre des Finances le jour du budget.

source: 1 (1) Paragraph 87(2)(j.6) of the Act is replaced by the following: Marginal note: Continuing corporation (j.6) for the purposes of paragraphs 12(1)(t) and (x), subsections 12(2.2) and 13(7.1), (7.4) and (24), paragraphs 13(27)(b) and (28)(c), subsections 13(29) and 18(9.1), paragraphs 20(1)(e), (e.1), (v) and (hh), sections 20.1 and 32, paragraph 37(1)(c), subsection 39(13), subparagraphs 53(2)(c)(vi) and (h)(ii), paragraph 53(2)(s), subsections 53(2.1), 66(11.4), 66.7(11) and 84.1(2.31) and (2.32), section 110.61, subsections 127(10.2) and 129(1.3) to (1.32), section 139.1, subsection 152(4.3), the determination of D in the definition undepreciated capital cost in subsection 13(21), the determination of L in the definition cumulative Canadian exploration expense in subsection 66.1(6) and the definition qualifying business transfer in subsection 248(1), the new corporation is deemed to be the same corporation as, and a continuation of, each predecessor corporation;
fr_fr: 1 (1) L'alinéa 87(2)j.6) de la même loi est remplacé par ce qui suit : Note marginale : Continuation j.6) pour l'application des alinéas 12(1)t) et x), des paragraphes 12(2.2) et 13(7.1), (7.4) et (24), des alinéas 13(27)b) et (28)c), des paragraphes 13(29) et 18(9.1), des alinéas 20(1)e), e.1), v) et hh), des articles 20.1 et 32, de l'alinéa 37(1)c), du paragraphe 39(13), des sous-alinéas 53(2)c)(vi) et h)(ii), de l'alinéa 53(2)s), des paragraphes 53(2.1), 66(11.4), 66.7(11) et 84.1(2.31) et (2.32), de l'article 110.61, des paragraphes 127(10.2) et 129(1.3) à (1.32), de l'article 139.1, du paragraphe 152(4.3), de l'élément D de la formule figurant à la définition de fraction non amortie du coût en capital au paragraphe 13(21), de l'élément L de la formule figurant à la définition de frais cumulatifs d'exploration au Canada au paragraphe 66.1(6) et de la définition de transfert admissible d'entreprise au paragraphe 248(1), la nouvelle société est réputée être la même société que chaque société remplacée et en être la continuation;

source: (2) Subsection (1) applies to taxation years that begin on or after Budget Day.
fr_fr: (2) Le paragraphe (1) s'applique aux années d'imposition qui commencent à compter du jour du budget.

source: 2 (1) Subsection 129(1.2) of the Act is replaced by the following: Marginal note: Dividends deemed not to be taxable dividends (1.2) Where a dividend is paid on a share of the capital stock of a corporation and the share (or another share for which the share was substituted) was acquired by its holder in a transaction or as part of a series of transactions one of the main purposes of which was to enable the corporation (or another corporation affiliated with the corporation) to obtain a dividend refund, the dividend shall, for the purposes of subsections (1) and (1.3) to (1.32), be deemed not to be a taxable dividend.
fr_fr: 2 (1) Le paragraphe 129(1.2) de la même loi est remplacé par ce qui suit : Note marginale : Dividendes réputés non imposables (1.2) Pour l'application des paragraphes (1) et (1.3) à (1.32), le dividende versé sur une action du capital-actions d'une société est réputé ne pas être un dividende imposable si l'actionnaire a acquis l'action — ou une action qui lui est substituée — par une opération, ou dans le cadre d'une série d'opérations, dont un des principaux objets consistait à permettre à la société (ou à une autre société affiliée à celle-ci) d'obtenir un remboursement au titre de dividendes.

source: Marginal note: Staggered year ends — dividend refund suspension (1.3) For the purpose of subsection (1) and subject to subsection (1.31), the amount of a dividend paid by a corporation (in this subsection and subsections (1.31) and (1.32) referred to as the "payer corporation") — other than a dividend to which paragraph 55(3)(a) or (b) applies in the course of a reorganization — is deemed not to be a taxable dividend to the extent that the dividend is received, directly or indirectly through one or more trusts or partnerships, by another corporation (in subsections (1.31) and (1.32) referred to as a "payee corporation") that: (a) is affiliated with the payer corporation immediately before the time the dividend is paid; (b) is a private corporation or a subject corporation (within the meaning assigned by subsection 186(3)); and (c) has a balance-due day for the taxation year in which it received the dividend that is after the balance-due day for the taxation year of the payer corporation (in subsection (1.31) referred to as the "payer-due day") in which it paid the dividend.
fr_fr: Note marginale : Exercices décalés — suspension du remboursement au titre de dividende (1.3) Pour l'application du paragraphe (1) et sous réserve du paragraphe (1.31), le montant d'un dividende versé par une société (appelée « société payante » au présent paragraphe et aux paragraphes (1.31) et (1.32)), sauf un dividende auquel s'appliquent les alinéas 55(3)a) ou b) dans le cadre d'une réorganisation, est réputé ne pas être un dividende imposable dans la mesure où il est reçu, directement ou indirectement par l'intermédiaire d'une ou de plusieurs fiducies ou sociétés de personnes, par une autre société (appelée « société bénéficiaire » aux paragraphes (1.31) et (1.32)) : a) qui est affiliée à la société payante immédiatement avant le moment où le dividende est versé; b) qui est une société privée ou une société assujettie (au sens du paragraphe 186(3)); c) dont la date d'exigibilité du solde pour l'année d'imposition au cours de laquelle elle a reçu le dividende est postérieure à la date d'exigibilité du solde de la société payante pour l'année d'imposition de la société payante (appelée « date d'exigibilité du payeur » au paragraphe (1.31)) au cours de laquelle elle a versé le dividende.
